---
title: ExternalDefinition
classe: Autodesk.Revit.DB.ExternalDefinition
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Definition
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# ExternalDefinition

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String Description { get; }` | `externalDefinition.Description` | String |
| `Guid GUID { get; }` | `externalDefinition.GUID` | Guid |
| `Boolean HideWhenNoValue { get; set; }` | `externalDefinition.HideWhenNoValue` | Boolean |
| `Boolean IsValidObject { get; }` | `externalDefinition.IsValidObject` | Boolean |
| `String Name { get; }` | `externalDefinition.Name` | String |
| `DefinitionGroup OwnerGroup { get; set; }` | `externalDefinition.OwnerGroup` | DefinitionGroup |
| `Boolean UserModifiable { get; }` | `externalDefinition.UserModifiable` | Boolean |
| `Boolean Visible { get; }` | `externalDefinition.Visible` | Boolean |
| `Void Dispose()` | `externalDefinition.Dispose()` | Void |
| `ForgeTypeId GetGroupTypeId()` | `externalDefinition.GetGroupTypeId()` | ForgeTypeId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```